app/views/questions/_question.html.erb

<% presenter = QuestionPresenter.new(question) %>
<% if cookies[:voted_questions].to_s.include?(question.id.to_s) %>
---
SELECT "questions".* FROM "questions"

        <br>
        <% presenter.choice_votes.each do |choice_vote_data| %>
---
SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1 ORDER BY votes DESC  [["question_id", 1]]

    <%= form_for :question, as: :choice_id, url: question_choice_url(question, :choice_id), method: :patch, html: { id: 'vote-form' } do |f| %>
        <% presenter.choices.each do |choice| %>
---
SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1 ORDER BY votes DESC  [["question_id", 1]]