app/views/questions/_question.html.erb

SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1  [["question_id", 1]]
---
    <%= form_for :question, as: :choice_id, url: question_choice_url(question, :choice_id), method: :patch do |f| %>
        <% presenter.choices.each do |choice| %>