app/presenters/question_presenter.rb

    def choices_for_question_prompt
        @question.choices.order('id ASC')
---
SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1 ORDER BY votes DESC  [["question_id", 3]]

    def choices_by_vote_count
        @question.choices.order('votes DESC')
---
SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = $1 ORDER BY votes DESC  [["question_id", 1]]