app/controllers/choices_controller.rb

    def update
        @choice = Choice.find_by(id: params[:question][:choice_id])

        if @choice
            session_token = session[:user_token] ||= SecureRandom.hex(16)
            voted_questions = session[session_token] ||= []
            unless voted_questions.include?(@choice.question.id)
---
SELECT "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]