app/models/choice.rb

    def add_vote
        self.votes += 1
        self.save
---
UPDATE "choices" SET "votes" = $1, "updated_at" = $2 WHERE "choices"."id" = $3  [["votes", 2], ["updated_at", "2023-09-09 20:37:49.344164"], ["id", 6]]